Revit 2026 API

# SpatialElementDomainData Properties

---

The SpatialElementDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SpatialElementDomainData Class

Autodesk.Revit.DB Namespace